TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/examples/c28x/dsp/dsp_fpu_rfft_fpu64_f2838x.c
//#############################################################################
//
// FILE:   empty_sysconfig_main.c
//
// TITLE:  Empty Pinmux Example
//
// Empty SysCfg & Driverlib Example
//
// This example is an empty project setup for SysConfig and Driverlib 
// development.
//
//#############################################################################
//
//
// 
// C2000Ware v26.00.00.00
//
// Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//#############################################################################


//
// Included Files
//
#include "driverlib.h"
#include "device.h"
#include "board.h"
#include "c2000ware_libraries.h"

#define USE_REAL_ADC_INPUT  0U

float64_t test_input[512] = {
   0.000000000000L,   21.572962329776L,   33.101549345938L,   31.348099381273L,
  21.659704690254L,   13.462635707408L,   12.925769914236L,   18.345490092755L,
  21.719821525992L,   15.285006398720L,   -1.977025287475L,  -22.848099381273L,
 -36.616267971699L,  -36.567315531530L,  -24.653242151256L,   -9.864728951361L,
  -1.544042094290L,   -2.652831629230L,   -8.015324001497L,   -8.790653196966L,
   0.272527762980L,   16.339843294510L,   30.205102900231L,   32.969408775483L,
  22.676216863781L,    5.899542724855L,   -6.941239279948L,   -9.060737722782L,
  -2.007650711028L,    5.894206751259L,    6.138637308489L,   -3.337234005992L,
 -16.500605375735L,  -23.785006398720L,  -19.410151639799L,   -5.913445609864L,
   7.559511460003L,   11.957184168489L,    5.001188172030L,   -7.169343802757L,
 -14.623918682727L,  -11.066384521027L,    1.507067914734L,   14.394206751259L,
  18.791879459745L,   12.421701696628L,    1.174423316016L,   -5.462830966734L,
  -1.735122948048L,    9.845490092755L,   20.212753611259L,   20.457184168489L,
   8.515906797791L,   -9.174990601002L,  -22.306598085507L,  -24.135271048639L,
 -16.167960777018L,   -6.618017855735L,   -3.853711980483L,   -9.831587207746L,
 -18.508256086763L,  -20.457184168489L,  -10.220404322287L,    9.161087715993L,
  27.895433014038L,   36.216119871109L,   31.161498238020L,   18.331587207746L,
   7.368430606245L,    4.612371057489L,    8.485281374239L,   11.066384521027L,
   4.631569393755L,  -11.837234005992L,  -31.161498238020L,  -42.710473072863L,
 -39.895433014038L,  -24.839843294509L,   -6.750158426190L,    4.778428589972L,
   6.508256086763L,    3.337234005992L,    3.853711980483L,   13.112371057489L,
  28.167960777018L,   39.814026627156L,   39.277160833983L,   24.853746179518L,
   3.484093202208L,  -13.962830966735L,  -20.212753611259L,  -16.339843294510L,
 -10.264877051952L,  -10.215924611782L,  -18.144986064493L,  -28.100457275144L,
 -30.791879459745L,  -20.888559953013L,   -1.507067914733L,   17.560737722782L,
  26.623918682727L,   22.848099381273L,   11.969374576447L,    3.721571410028L,
   4.440488539997L,   12.407798811619L,   19.410151639799L,   17.290653196966L,
   4.500605375735L,  -12.341521572525L,  -23.109200056966L,  -21.572962329775L,
  -9.992349288972L,    2.566384521028L,    6.941239279948L,    0.594810476899L,
 -10.676216863781L,  -17.290653196966L,  -13.234540151754L,   -0.661087715993L,
  11.727472237020L,   15.285006398720L,    8.015324001497L,   -3.841521572525L,
 -10.455957905710L,   -5.814026627156L,    7.682679402779L,   20.888559953014L,
  24.616267971700L,   16.353746179518L,    1.977025287475L,   -8.790653196966L,
  -9.719821525992L,   -2.666734514239L,    4.044792834241L,    2.216119871108L,
  -9.659704690255L,  -24.853746179519L,  -33.101549345938L,  -28.067315531530L,
 -12.000000000000L,    5.894206751259L,   16.130986597461L,   15.669343802756L,
   9.659704690254L,    6.968282505654L,   12.925769914236L,   24.839843294510L,
  33.719821525993L,   30.963761977237L,   14.993537461001L,   -7.169343802757L,
 -24.616267971700L,  -30.072962329776L,  -24.653242151256L,  -16.359082153115L,
 -13.544042094290L,  -18.331587207746L,  -24.985886749974L,  -24.469408775482L,
 -11.727472237020L,    9.845490092756L,   30.205102900232L,   39.463761977237L,
  34.676216863781L,   21.578298303372L,   10.029323468528L,    6.618017855735L,
   9.992349288972L,   12.388559953013L,    6.138637308488L,   -9.831587207747L,
 -28.500605375736L,  -39.463761977237L,  -36.380714388276L,  -21.592201188380L,
  -4.440488539997L,    5.462830966735L,    5.001188172030L,   -0.674990601002L,
  -2.623918682727L,    4.612371057489L,   18.477630663211L,   30.072962329776L,
  30.791879459745L,   18.916054898382L,    1.174423316015L,  -11.957184168489L,
 -13.735122948048L,   -5.833265485761L,    3.242190862782L,    4.778428589972L,
  -3.484093202209L,  -15.669343802756L,  -22.306598085506L,  -17.640917846885L,
  -4.167960777017L,    9.060737722782L,   13.116850767994L,    5.847168370770L,
  -6.508256086764L,  -13.962830966735L,  -10.220404322287L,    2.666734514239L,
  15.895433014038L,   20.537364292592L,   14.190935489542L,    2.652831629230L,
  -4.631569393755L,   -1.881982144265L,    8.485281374239L,   17.560737722782L,
  16.631569393755L,    3.841521572524L,  -14.190935489543L,  -27.031717494347L,
 -27.895433014038L,  -18.345490092755L,   -6.750158426190L,   -1.715924611782L,
  -5.491743913237L,  -12.341521572525L,  -13.116850767994L,   -2.566384521027L,
  16.167960777019L,   33.319673425402L,   39.277160833984L,   31.348099381273L,
  15.484093202208L,    1.715924611782L,   -3.242190862782L,   -0.661087715993L,
   1.735122948048L,   -3.721571410028L,  -18.144986064494L,  -34.594810476899L,
 -42.791879459745L,  -36.567315531529L,  -18.477630663210L,    1.881982144266L,
  14.623918682728L,   16.353746179519L,   11.969374576447L,   10.215924611782L,
  16.440488539998L,   28.086554390136L,   36.380714388277L,   32.969408775482L,
  16.500605375734L,   -5.847168370771L,  -23.109200056967L,  -28.067315531530L,
 -21.992349288972L,  -13.112371057489L,  -10.029323468529L,  -15.083945101618L,
 -22.676216863781L,  -23.785006398720L,  -13.234540151753L,    5.833265485762L,
  23.727472237021L,   30.963761977237L,   24.985886749973L,   11.837234005991L,
   1.544042094290L,    0.680326574598L,    7.682679402779L,   14.394206751259L,
  12.616267971699L,    0.674990601002L,  -14.993537461002L,  -24.469408775482L,
 -21.719821525992L,   -9.161087715992L,    4.044792834242L,    8.710473072863L,
   2.340295309745L,   -9.174990601003L,  -16.130986597461L,  -12.388559953013L,
   0.000000000000L,   12.388559953014L,   16.130986597460L,    9.174990601001L,
  -2.340295309746L,   -8.710473072863L,   -4.044792834241L,    9.161087715994L,
  21.719821525993L,   24.469408775483L,   14.993537461002L,   -0.674990601003L,
 -12.616267971700L,  -14.394206751259L,   -7.682679402779L,   -0.680326574599L,
  -1.544042094291L,  -11.837234005993L,  -24.985886749975L,  -30.963761977237L,
 -23.727472237020L,   -5.833265485760L,   13.234540151755L,   23.785006398721L,
  22.676216863781L,   15.083945101618L,   10.029323468529L,   13.112371057490L,
  21.992349288972L,   28.067315531530L,   23.109200056965L,    5.847168370769L,
 -16.500605375737L,  -32.969408775483L,  -36.380714388277L,  -28.086554390135L,
 -16.440488539997L,  -10.215924611782L,  -11.969374576447L,  -16.353746179518L,
 -14.623918682727L,   -1.881982144264L,   18.477630663212L,   36.567315531531L,
  42.791879459745L,   34.594810476898L,   18.144986064492L,    3.721571410027L,
  -1.735122948049L,    0.661087715993L,    3.242190862782L,   -1.715924611783L,
 -15.484093202209L,  -31.348099381273L,  -39.277160833983L,  -33.319673425401L,
 -16.167960777016L,    2.566384521029L,   13.116850767994L,   12.341521572525L,
   5.491743913236L,    1.715924611782L,    6.750158426190L,   18.345490092755L,
  27.895433014038L,   27.031717494346L,   14.190935489541L,   -3.841521572526L,
 -16.631569393756L,  -17.560737722781L,   -8.485281374238L,    1.881982144266L,
   4.631569393756L,   -2.652831629230L,  -14.190935489543L,  -20.537364292592L,
 -15.895433014038L,   -2.666734514238L,   10.220404322287L,   13.962830966734L,
   6.508256086762L,   -5.847168370771L,  -13.116850767994L,   -9.060737722781L,
   4.167960777018L,   17.640917846886L,   22.306598085507L,   15.669343802756L,
   3.484093202209L,   -4.778428589972L,   -3.242190862781L,    5.833265485762L,
  13.735122948049L,   11.957184168488L,   -1.174423316017L,  -18.916054898384L,
 -30.791879459746L,  -30.072962329776L,  -18.477630663210L,   -4.612371057489L,
   2.623918682727L,    0.674990601002L,   -5.001188172030L,   -5.462830966734L,
   4.440488539998L,   21.592201188383L,   36.380714388278L,   39.463761977237L,
  28.500605375735L,    9.831587207745L,   -6.138637308490L,  -12.388559953014L,
  -9.992349288972L,   -6.618017855735L,  -10.029323468530L,  -21.578298303373L,
 -34.676216863782L,  -39.463761977237L,  -30.205102900230L,   -9.845490092753L,
  11.727472237022L,   24.469408775483L,   24.985886749974L,   18.331587207746L,
  13.544042094290L,   16.359082153115L,   24.653242151256L,   30.072962329775L,
  24.616267971698L,    7.169343802755L,  -14.993537461004L,  -30.963761977238L,
 -33.719821525992L,  -24.839843294509L,  -12.925769914235L,   -6.968282505653L,
  -9.659704690254L,  -15.669343802756L,  -16.130986597460L,   -5.894206751258L,
  12.000000000001L,   28.067315531530L,   33.101549345937L,   24.853746179517L,
   9.659704690253L,   -2.216119871109L,   -4.044792834242L,    2.666734514239L,
   9.719821525993L,    8.790653196966L,   -1.977025287476L,  -16.353746179519L,
 -24.616267971699L,  -20.888559953012L,   -7.682679402778L,    5.814026627157L,
  10.455957905710L,    3.841521572524L,   -8.015324001498L,  -15.285006398721L,
 -11.727472237020L,    0.661087715993L,   13.234540151754L,   17.290653196966L,
  10.676216863780L,   -0.594810476899L,   -6.941239279948L,   -2.566384521026L,
   9.992349288974L,   21.572962329777L,   23.109200056966L,   12.341521572524L,
  -4.500605375736L,  -17.290653196967L,  -19.410151639800L,  -12.407798811619L,
  -4.440488539997L,   -3.721571410029L,  -11.969374576448L,  -22.848099381274L,
 -26.623918682727L,  -17.560737722781L,    1.507067914735L,   20.888559953015L,
  30.791879459746L,   28.100457275145L,   18.144986064493L,   10.215924611782L,
  10.264877051952L,   16.339843294510L,   20.212753611259L,   13.962830966733L,
  -3.484093202211L,  -24.853746179520L,  -39.277160833985L,  -39.814026627156L,
 -28.167960777017L,  -13.112371057488L,   -3.853711980482L,   -3.337234005991L,
  -6.508256086763L,   -4.778428589971L,    6.750158426192L,   24.839843294511L,
  39.895433014039L,   42.710473072862L,   31.161498238018L,   11.837234005990L,
  -4.631569393757L,  -11.066384521028L,   -8.485281374239L,   -4.612371057489L,
  -7.368430606245L,  -18.331587207747L,  -31.161498238020L,  -36.216119871108L,
 -27.895433014036L,   -9.161087715991L,   10.220404322289L,   20.457184168489L,
  18.508256086763L,    9.831587207745L,    3.853711980483L,    6.618017855735L,
  16.167960777018L,   24.135271048639L,   22.306598085505L,    9.174990601001L,
  -8.515906797793L,  -20.457184168489L,  -20.212753611258L,   -9.845490092754L,
};
