TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/examples/c28x/dsp/dsp_fpu_rfft_fpu64_f2838x.c
uint16_t pass = 0U, fail = 0U;
float64_t tolerance = 3.2e-7;

volatile uint16_t flagInputReady = 0;
volatile uint16_t sampleIndex = 0;
uint32_t max_idx = 1;

#if USE_REAL_ADC_INPUT == 1U
#ifdef __cplusplus
#pragma DATA_SECTION("FFT_buffer_1")
#else
#pragma DATA_SECTION(test_input, "FFT_buffer_1")
#endif

uint16_t test_input[4U*myRFFT0_RFFT_SIZE];
#endif

#ifdef __cplusplus
#pragma DATA_SECTION("FFT_buffer_2")
#else
#pragma DATA_SECTION(test_output, "FFT_buffer_2")
#endif
float64_t test_output[myRFFT0_RFFT_SIZE];
float64_t test_magnitude_phase[(myRFFT0_RFFT_SIZE >> 1) + 1];
float64_t twiddleFactors[myRFFT0_RFFT_SIZE];

float64_t *inPtr = (float64_t *)test_input;
float64_t *outPtr = test_output;

//
// Main
//
void main(void)
{
    //
    // Initialize CPU and peripherals
    //
    Device_init();
    Device_initGPIO();
    Interrupt_initModule();
    Interrupt_initVectorTable();
    Board_init();
    C2000Ware_libraries_init();

    int16_t i, j;
    float64u_t out, gold, errld;
    float64_t *p_temp;

    myRFFT0_handle->calc(myRFFT0_handle);

    for(i = 0U; i < myRFFT0_RFFT_SIZE; i++)
    {
        out.f64 = myRFFT0_handle->p_currOutput[i];
        gold.f64 = test_golden[i];
        errld.f64 = fabsf(out.f64 - gold.f64);
        if(errld.f64 < tolerance)
        {
            pass++;
        }
        else
        {
            fail++;
        }
    }

    p_temp = CFFT_f64_getCurrInputPtr(myRFFT0_handle);
    CFFT_f64_setCurrInputPtr(myRFFT0_handle, CFFT_f64_getCurrOutputPtr(myRFFT0_handle));
    CFFT_f64_setCurrOutputPtr(myRFFT0_handle, p_temp);

    myRFFT0_handle->mag(myRFFT0_handle);

    for(i = (myRFFT0_RFFT_SIZE), j=0U; i <= (myRFFT0_RFFT_SIZE+(myRFFT0_RFFT_SIZE >> 1)); i++, j++)
    {
        out.f64 = myRFFT0_handle->p_currOutput[j];
        gold.f64 = test_golden[i];
        errld.f64 = fabsf(out.f64 - gold.f64);
        if(errld.f64 < tolerance)
        {
            pass++;
        }
        else
        {
            fail++;
        }
    }

    myRFFT0_handle->phase(myRFFT0_handle);

    for(i = (myRFFT0_RFFT_SIZE+(myRFFT0_RFFT_SIZE >> 1)) + 1U, j=0U; i <= (2U * myRFFT0_RFFT_SIZE) + 1U; i++, j++)
    {
        out.f64 = myRFFT0_handle->p_currOutput[j];
        gold.f64 = test_golden[i];
        errld.f64 = fabsf(out.f64 - gold.f64);
        if(errld.f64 < tolerance)
        {
            pass++;
        }
        else
        {
            fail++;
        }
    }
    while(1);
}

//
// End of File
//
